In [1]:
import pandas as pd

In [7]:
df = pd.read_csv(r"E:\Python\Machine Learning\datasets\collegedata.csv")

In [8]:
df

   roll_num    name   class    address          dob
0         1    ABCD      11  fkjdfklvj  12-mar-2002
1         2    ASFF      11   dlfkdflk  12-mar-2002
2         3    ASFW      11      dflkm  12-mar-2002
3         4  FGFDFV      11     rtgoke  12-mar-2002
4         5    DGFH      11       egkl  12-mar-2002
5         6  dfGFGH      11       wefj  12-mar-2002

In [11]:
df.columns

Index(['roll_num', ' name', ' class', ' address', ' dob'], dtype='object')

In [13]:
df[' name'].apply(len)

0    4
1    4
2    4
3    6
4    4
5    6
Name:  name, dtype: int64

In [15]:
df["cnt"]=df[' name'].apply(len)

In [16]:
df

   roll_num    name   class    address          dob  cnt
0         1    ABCD      11  fkjdfklvj  12-mar-2002    4
1         2    ASFF      11   dlfkdflk  12-mar-2002    4
2         3    ASFW      11      dflkm  12-mar-2002    4
3         4  FGFDFV      11     rtgoke  12-mar-2002    6
4         5    DGFH      11       egkl  12-mar-2002    4
5         6  dfGFGH      11       wefj  12-mar-2002    6